{"id":"8e181304-132d-441d-8455-d3b5f483d0d1","revision":0,"last_node_id":5,"last_link_id":5,"nodes":[{"id":4,"type":"IPCompLoadOpenCLIP","pos":[-1300,-2270],"size":[280,90],"flags":{},"order":0,"mode":0,"inputs":[{"localized_name":"clip_vision","name":"clip_vision","type":"COMBO","widget":{"name":"clip_vision"},"link":null},{"localized_name":"device","name":"device","type":"STRING","widget":{"name":"device"},"link":null}],"outputs":[{"localized_name":"OPEN_CLIP","name":"OPEN_CLIP","type":"OPEN_CLIP","links":[3]}],"properties":{"aux_id":"godmt/ComfyUI-IP-Composer","ver":"6dce09ba73f0daa4be2ef42e8b9c0cc1e83e0ab7","Node name for S&R":"IPCompLoadOpenCLIP","widget_ue_connectable":{}},"widgets_values":["ViT-H-14","cuda:0"],"color":"#322","bgcolor":"#533"},{"id":3,"type":"IPCompConceptSubspace","pos":[-1000,-2270],"size":[240,140],"flags":{},"order":2,"mode":0,"inputs":[{"localized_name":"open_clip_model","name":"open_clip_model","type":"OPEN_CLIP","link":3},{"localized_name":"descriptions","name":"descriptions","type":"STRING","widget":{"name":"descriptions"},"link":4},{"localized_name":"rank","name":"rank","type":"INT","widget":{"name":"rank"},"link":null},{"localized_name":"batch_size","name":"batch_size","type":"INT","widget":{"name":"batch_size"},"link":null}],"outputs":[{"localized_name":"concept_subspace","name":"concept_subspace","type":"CONCEPT_SUBSPACE","links":[5]}],"properties":{"aux_id":"godmt/ComfyUI-IP-Composer","ver":"6dce09ba73f0daa4be2ef42e8b9c0cc1e83e0ab7","Node name for S&R":"IPCompConceptSubspace","widget_ue_connectable":{}},"widgets_values":["",30,100],"color":"#322","bgcolor":"#533"},{"id":1,"type":"StringConstantMultiline","pos":[-1300,-2080],"size":[430,470],"flags":{},"order":1,"mode":0,"inputs":[{"localized_name":"string","name":"string","type":"STRING","widget":{"name":"string"},"link":null},{"localized_name":"strip_newlines","name":"strip_newlines","type":"BOOLEAN","widget":{"name":"strip_newlines"},"link":null}],"outputs":[{"localized_name":"STRING","name":"STRING","type":"STRING","links":[4]}],"title":"fur","properties":{"cnr_id":"comfyui-kjnodes","ver":"c3dc82108a2a86c17094107ead61d63f8c76200e","Node name for S&R":"StringConstantMultiline","widget_ue_connectable":{}},"widgets_values":["A picture with a red sports car.\nA picture with a blue sports car.\nA picture with a green sports car.\nA picture with a yellow sports car.\nA picture with a black sports car.\nA picture with a white sports car.\nA picture with a orange sports car.\nA picture with a purple sports car.\nA picture with a red sedan.\nA picture with a blue sedan.\nA picture with a green sedan.\nA picture with a yellow sedan.\nA picture with a black sedan.\nA picture with a white sedan.\nA picture with a orange sedan.\nA picture with a purple sedan.\nA picture with a red school bus.\nA picture with a blue school bus.\nA picture with a green school bus.\nA picture with a yellow school bus.\nA picture with a black school bus.\nA picture with a white school bus.\nA picture with a orange school bus.\nA picture with a purple school bus.\nA picture with a red pickup truck.\nA picture with a blue pickup truck.\nA picture with a green pickup truck.\nA picture with a yellow pickup truck.\nA picture with a black pickup truck.\nA picture with a white pickup truck.\nA picture with a orange pickup truck.\nA picture with a purple pickup truck.\nA picture with a red convertible.\nA picture with a blue convertible.\nA picture with a green convertible.\nA picture with a yellow convertible.\nA picture with a black convertible.\nA picture with a white convertible.\nA picture with a orange convertible.\nA picture with a purple convertible.\nA picture with a red SUV.\nA picture with a blue SUV.\nA picture with a green SUV.\nA picture with a yellow SUV.\nA picture with a black SUV.\nA picture with a white SUV.\nA picture with a orange SUV.\nA picture with a purple SUV.\nA picture with a red classic car.\nA picture with a blue classic car.\nA picture with a green classic car.\nA picture with a yellow classic car.\nA picture with a black classic car.\nA picture with a white classic car.\nA picture with a orange classic car.\nA picture with a purple classic car.\nA picture with a red minivan.\nA picture with a blue minivan.\nA picture with a green minivan.\nA picture with a yellow minivan.\nA picture with a black minivan.\nA picture with a white minivan.\nA picture with a orange minivan.\nA picture with a purple minivan.\nA picture with a red motorcycle.\nA picture with a blue motorcycle.\nA picture with a green motorcycle.\nA picture with a yellow motorcycle.\nA picture with a black motorcycle.\nA picture with a white motorcycle.\nA picture with a orange motorcycle.\nA picture with a purple motorcycle.\nA picture with a red delivery van.\nA picture with a blue delivery van.\nA picture with a green delivery van.\nA picture with a yellow delivery van.\nA picture with a black delivery van.\nA picture with a white delivery van.\nA picture with a orange delivery van.\nA picture with a purple delivery van.\nA picture with a red vintage truck.\nA picture with a blue vintage truck.\nA picture with a green vintage truck.\nA picture with a yellow vintage truck.\nA picture with a black vintage truck.\nA picture with a white vintage truck.\nA picture with a orange vintage truck.\nA picture with a purple vintage truck.\nA picture with a red limousine.\nA picture with a blue limousine.\nA picture with a green limousine.\nA picture with a yellow limousine.\nA picture with a black limousine.\nA picture with a white limousine.\nA picture with a orange limousine.\nA picture with a purple limousine.\nA picture with a red hatchback.\nA picture with a blue hatchback.\nA picture with a green hatchback.\nA picture with a yellow hatchback.\nA picture with a black hatchback.\nA picture with a white hatchback.\nA picture with a orange hatchback.\nA picture with a purple hatchback.\nA picture with a red coupe.\nA picture with a blue coupe.\nA picture with a green coupe.\nA picture with a yellow coupe.\nA picture with a black coupe.\nA picture with a white coupe.\nA picture with a orange coupe.\nA picture with a purple coupe.\nA picture with a red dune buggy.\nA picture with a blue dune buggy.\nA picture with a green dune buggy.\nA picture with a yellow dune buggy.\nA picture with a black dune buggy.\nA picture with a white dune buggy.\nA picture with a orange dune buggy.\nA picture with a purple dune buggy.\nA picture with a red racecar.\nA picture with a blue racecar.\nA picture with a green racecar.\nA picture with a yellow racecar.\nA picture with a black racecar.\nA picture with a white racecar.\nA picture with a orange racecar.\nA picture with a purple racecar.\nA picture with a red electric car.\nA picture with a blue electric car.\nA picture with a green electric car.\nA picture with a yellow electric car.\nA picture with a black electric car.\nA picture with a white electric car.\nA picture with a orange electric car.\nA picture with a purple electric car.\nA picture with a red luxury SUV.\nA picture with a blue luxury SUV.\nA picture with a green luxury SUV.\nA picture with a yellow luxury SUV.\nA picture with a black luxury SUV.\nA picture with a white luxury SUV.\nA picture with a orange luxury SUV.\nA picture with a purple luxury SUV.\nA picture with a red police car.\nA picture with a blue police car.\nA picture with a green police car.\nA picture with a yellow police car.\nA picture with a black police car.\nA picture with a white police car.\nA picture with a orange police car.\nA picture with a purple police car.\nA picture with a red military jeep.\nA picture with a blue military jeep.\nA picture with a green military jeep.\nA picture with a yellow military jeep.\nA picture with a black military jeep.\nA picture with a white military jeep.\nA picture with a orange military jeep.\nA picture with a purple military jeep.\nA picture with a red taxi cab.\nA picture with a blue taxi cab.\nA picture with a green taxi cab.\nA picture with a yellow taxi cab.\nA picture with a black taxi cab.\nA picture with a white taxi cab.\nA picture with a orange taxi cab.\nA picture with a purple taxi cab.\nA picture with a red camper van.\nA picture with a blue camper van.\nA picture with a green camper van.\nA picture with a yellow camper van.\nA picture with a black camper van.\nA picture with a white camper van.\nA picture with a orange camper van.\nA picture with a purple camper van.\nA picture with a red firetruck.\nA picture with a blue firetruck.\nA picture with a green firetruck.\nA picture with a yellow firetruck.\nA picture with a black firetruck.\nA picture with a white firetruck.\nA picture with a orange firetruck.\nA picture with a purple firetruck.\nA picture with a red tow truck.\nA picture with a blue tow truck.\nA picture with a green tow truck.\nA picture with a yellow tow truck.\nA picture with a black tow truck.\nA picture with a white tow truck.\nA picture with a orange tow truck.\nA picture with a purple tow truck.\nA picture with a red cargo truck.\nA picture with a blue cargo truck.\nA picture with a green cargo truck.\nA picture with a yellow cargo truck.\nA picture with a black cargo truck.\nA picture with a white cargo truck.\nA picture with a orange cargo truck.\nA picture with a purple cargo truck.\nA picture with a red garbage truck.\nA picture with a blue garbage truck.\nA picture with a green garbage truck.\nA picture with a yellow garbage truck.\nA picture with a black garbage truck.\nA picture with a white garbage truck.\nA picture with a orange garbage truck.\nA picture with a purple garbage truck.\nA picture with a red roadster.\nA picture with a blue roadster.\nA picture with a green roadster.\nA picture with a yellow roadster.\nA picture with a black roadster.\nA picture with a white roadster.\nA picture with a orange roadster.\nA picture with a purple roadster.\nA picture with a red armored vehicle.\nA picture with a blue armored vehicle.\nA picture with a green armored vehicle.\nA picture with a yellow armored vehicle.\nA picture with a black armored vehicle.\nA picture with a white armored vehicle.\nA picture with a orange armored vehicle.\nA picture with a purple armored vehicle.\nA picture with a red antique car.\nA picture with a blue antique car.\nA picture with a green antique car.\nA picture with a yellow antique car.\nA picture with a black antique car.\nA picture with a white antique car.\nA picture with a orange antique car.\nA picture with a purple antique car.\nA picture with a red tractor.\nA picture with a blue tractor.\nA picture with a green tractor.\nA picture with a yellow tractor.\nA picture with a black tractor.\nA picture with a white tractor.\nA picture with a orange tractor.\nA picture with a purple tractor.\nA picture with a red RV.\nA picture with a blue RV.\nA picture with a green RV.\nA picture with a yellow RV.\nA picture with a black RV.\nA picture with a white RV.\nA picture with a orange RV.\nA picture with a purple RV.\nA picture with a red ambulance.\nA picture with a blue ambulance.\nA picture with a green ambulance.\nA picture with a yellow ambulance.\nA picture with a black ambulance.\nA picture with a white ambulance.\nA picture with a orange ambulance.\nA picture with a purple ambulance.\nA picture with a red hearse.\nA picture with a blue hearse.\nA picture with a green hearse.\nA picture with a yellow hearse.\nA picture with a black hearse.\nA picture with a white hearse.\nA picture with a orange hearse.\nA picture with a purple hearse.\nA picture with a red race bike.\nA picture with a blue race bike.\nA picture with a green race bike.\nA picture with a yellow race bike.\nA picture with a black race bike.\nA picture with a white race bike.\nA picture with a orange race bike.\nA picture with a purple race bike.\nA picture with a red quad bike.\nA picture with a blue quad bike.\nA picture with a green quad bike.\nA picture with a yellow quad bike.\nA picture with a black quad bike.\nA picture with a white quad bike.\nA picture with a orange quad bike.\nA picture with a purple quad bike.\nA picture with a red scooter.\nA picture with a blue scooter.\nA picture with a green scooter.\nA picture with a yellow scooter.\nA picture with a black scooter.\nA picture with a white scooter.\nA picture with a orange scooter.\nA picture with a purple scooter.\nA picture with a red luxury car.\nA picture with a blue luxury car.\nA picture with a green luxury car.\nA picture with a yellow luxury car.\nA picture with a black luxury car.\nA picture with a white luxury car.\nA picture with a orange luxury car.\nA picture with a purple luxury car.\nA picture with a red stretch limousine.\nA picture with a blue stretch limousine.\nA picture with a green stretch limousine.\nA picture with a yellow stretch limousine.\nA picture with a black stretch limousine.\nA picture with a white stretch limousine.\nA picture with a orange stretch limousine.\nA picture with a purple stretch limousine.\nA picture with a red tank truck.\nA picture with a blue tank truck.\nA picture with a green tank truck.\nA picture with a yellow tank truck.\nA picture with a black tank truck.\nA picture with a white tank truck.\nA picture with a orange tank truck.\nA picture with a purple tank truck.\nA picture with a red custom bike.\nA picture with a blue custom bike.\nA picture with a green custom bike.\nA picture with a yellow custom bike.\nA picture with a black custom bike.\nA picture with a white custom bike.\nA picture with a orange custom bike.\nA picture with a purple custom bike.\nA picture with a red snowmobile.\nA picture with a blue snowmobile.\nA picture with a green snowmobile.\nA picture with a yellow snowmobile.\nA picture with a black snowmobile.\nA picture with a white snowmobile.\nA picture with a orange snowmobile.\nA picture with a purple snowmobile.\nA picture with a red ATV.\nA picture with a blue ATV.\nA picture with a green ATV.\nA picture with a yellow ATV.\nA picture with a black ATV.\nA picture with a white ATV.\nA picture with a orange ATV.\nA picture with a purple ATV.\nA picture with a red three-wheeler.\nA picture with a blue three-wheeler.\nA picture with a green three-wheeler.\nA picture with a yellow three-wheeler.\nA picture with a black three-wheeler.\nA picture with a white three-wheeler.\nA picture with a orange three-wheeler.\nA picture with a purple three-wheeler.\nA picture with a red ice cream truck.\nA picture with a blue ice cream truck.\nA picture with a green ice cream truck.\nA picture with a yellow ice cream truck.\nA picture with a black ice cream truck.\nA picture with a white ice cream truck.\nA picture with a orange ice cream truck.\nA picture with a purple ice cream truck.\nA picture with a red crane truck.\nA picture with a blue crane truck.\nA picture with a green crane truck.\nA picture with a yellow crane truck.\nA picture with a black crane truck.\nA picture with a white crane truck.\nA picture with a orange crane truck.\nA picture with a purple crane truck.\nA picture with a red hybrid SUV.\nA picture with a blue hybrid SUV.\nA picture with a green hybrid SUV.\nA picture with a yellow hybrid SUV.\nA picture with a black hybrid SUV.\nA picture with a white hybrid SUV.\nA picture with a orange hybrid SUV.\nA picture with a purple hybrid SUV.\nA picture with a red cruiser.\nA picture with a blue cruiser.\nA picture with a green cruiser.\nA picture with a yellow cruiser.\nA picture with a black cruiser.\nA picture with a white cruiser.\nA picture with a orange cruiser.\nA picture with a purple cruiser.\nA picture with a red farm truck.\nA picture with a blue farm truck.\nA picture with a green farm truck.\nA picture with a yellow farm truck.\nA picture with a black farm truck.\nA picture with a white farm truck.\nA picture with a orange farm truck.\nA picture with a purple farm truck.\nA picture with a red sports bike.\nA picture with a blue sports bike.\nA picture with a green sports bike.\nA picture with a yellow sports bike.\nA picture with a black sports bike.\nA picture with a white sports bike.\nA picture with a orange sports bike.\nA picture with a purple sports bike.\nA picture with a red hybrid car.\nA picture with a blue hybrid car.\nA picture with a green hybrid car.\nA picture with a yellow hybrid car.\nA picture with a black hybrid car.\nA picture with a white hybrid car.\nA picture with a orange hybrid car.\nA picture with a purple hybrid car.\nA picture with a red monster truck.\nA picture with a blue monster truck.\nA picture with a green monster truck.\nA picture with a yellow monster truck.\nA picture with a black monster truck.\nA picture with a white monster truck.\nA picture with a orange monster truck.\nA picture with a purple monster truck.\nA picture with a red off-road vehicle.\nA picture with a blue off-road vehicle.\nA picture with a green off-road vehicle.\nA picture with a yellow off-road vehicle.\nA picture with a black off-road vehicle.\nA picture with a white off-road vehicle.\nA picture with a orange off-road vehicle.\nA picture with a purple off-road vehicle.\nA picture with a red custom van.\nA picture with a blue custom van.\nA picture with a green custom van.\nA picture with a yellow custom van.\nA picture with a black custom van.\nA picture with a white custom van.\nA picture with a orange custom van.\nA picture with a purple custom van.\nA picture with a red jet ski trailer.\nA picture with a blue jet ski trailer.\nA picture with a green jet ski trailer.\nA picture with a yellow jet ski trailer.\nA picture with a black jet ski trailer.\nA picture with a white jet ski trailer.\nA picture with a orange jet ski trailer.\nA picture with a purple jet ski trailer.\nA picture with a red ladder truck.\nA picture with a blue ladder truck.\nA picture with a green ladder truck.\nA picture with a yellow ladder truck.\nA picture with a black ladder truck.\nA picture with a white ladder truck.\nA picture with a orange ladder truck.\nA picture with a purple ladder truck.\nA picture with a red racing SUV.\nA picture with a blue racing SUV.\nA picture with a green racing SUV.\nA picture with a yellow racing SUV.\nA picture with a black racing SUV.\nA picture with a white racing SUV.\nA picture with a orange racing SUV.\nA picture with a purple racing SUV.\nA picture with a red touring bus.\nA picture with a blue touring bus.\nA picture with a green touring bus.\nA picture with a yellow touring bus.\nA picture with a black touring bus.\nA picture with a white touring bus.\nA picture with a orange touring bus.\nA picture with a purple touring bus.\nA picture with a red electric van.\nA picture with a blue electric van.\nA picture with a green electric van.\nA picture with a yellow electric van.\nA picture with a black electric van.\nA picture with a white electric van.\nA picture with a orange electric van.\nA picture with a purple electric van.\nA picture with a red compact car.\nA picture with a blue compact car.\nA picture with a green compact car.\nA picture with a yellow compact car.\nA picture with a black compact car.\nA picture with a white compact car.\nA picture with a orange compact car.\nA picture with a purple compact car.\nA picture with a red autonomous shuttle bus.\nA picture with a blue autonomous shuttle bus.\nA picture with a green autonomous shuttle bus.\nA picture with a yellow autonomous shuttle bus.\nA picture with a black autonomous shuttle bus.\nA picture with a white autonomous shuttle bus.\nA picture with a orange autonomous shuttle bus.\nA picture with a purple autonomous shuttle bus.\nA picture with a red construction truck.\nA picture with a blue construction truck.\nA picture with a green construction truck.\nA picture with a yellow construction truck.\nA picture with a black construction truck.\nA picture with a white construction truck.\nA picture with a orange construction truck.\nA picture with a purple construction truck.\nA picture with a red bank truck.\nA picture with a blue bank truck.\nA picture with a green bank truck.\nA picture with a yellow bank truck.\nA picture with a black bank truck.\nA picture with a white bank truck.\nA picture with a orange bank truck.\nA picture with a purple bank truck.\nA picture with a red city bus.\nA picture with a blue city bus.\nA picture with a green city bus.\nA picture with a yellow city bus.\nA picture with a black city bus.\nA picture with a white city bus.\nA picture with a orange city bus.\nA picture with a purple city bus.\nA picture with a red station wagon.\nA picture with a blue station wagon.\nA picture with a green station wagon.\nA picture with a yellow station wagon.\nA picture with a black station wagon.\nA picture with a white station wagon.\nA picture with a orange station wagon.\nA picture with a purple station wagon.\nA picture with a red golf cart.\nA picture with a blue golf cart.\nA picture with a green golf cart.\nA picture with a yellow golf cart.\nA picture with a black golf cart.\nA picture with a white golf cart.\nA picture with a orange golf cart.\nA picture with a purple golf cart.\nA picture with a red dirt bike.\nA picture with a blue dirt bike.\nA picture with a green dirt bike.\nA picture with a yellow dirt bike.\nA picture with a black dirt bike.\nA picture with a white dirt bike.\nA picture with a orange dirt bike.\nA picture with a purple dirt bike.\nA picture with a red off-road jeep.\nA picture with a blue off-road jeep.\nA picture with a green off-road jeep.\nA picture with a yellow off-road jeep.\nA picture with a black off-road jeep.\nA picture with a white off-road jeep.\nA picture with a orange off-road jeep.\nA picture with a purple off-road jeep.\nA picture with a red solar car.\nA picture with a blue solar car.\nA picture with a green solar car.\nA picture with a yellow solar car.\nA picture with a black solar car.\nA picture with a white solar car.\nA picture with a orange solar car.\nA picture with a purple solar car.\nA picture with a red drift car.\nA picture with a blue drift car.\nA picture with a green drift car.\nA picture with a yellow drift car.\nA picture with a black drift car.\nA picture with a white drift car.\nA picture with a orange drift car.\nA picture with a purple drift car.\nA picture with a red patrol vehicle.\nA picture with a blue patrol vehicle.\nA picture with a green patrol vehicle.\nA picture with a yellow patrol vehicle.\nA picture with a black patrol vehicle.\nA picture with a white patrol vehicle.\nA picture with a orange patrol vehicle.\nA picture with a purple patrol vehicle.\nA picture with a red supercar.\nA picture with a blue supercar.\nA picture with a green supercar.\nA picture with a yellow supercar.\nA picture with a black supercar.\nA picture with a white supercar.\nA picture with a orange supercar.\nA picture with a purple supercar.\nA picture with a red tricycle.\nA picture with a blue tricycle.\nA picture with a green tricycle.\nA picture with a yellow tricycle.\nA picture with a black tricycle.\nA picture with a white tricycle.\nA picture with a orange tricycle.\nA picture with a purple tricycle.\nA picture with a red cargo van.\nA picture with a blue cargo van.\nA picture with a green cargo van.\nA picture with a yellow cargo van.\nA picture with a black cargo van.\nA picture with a white cargo van.\nA picture with a orange cargo van.\nA picture with a purple cargo van.\nA picture with a red camper trailer.\nA picture with a blue camper trailer.\nA picture with a green camper trailer.\nA picture with a yellow camper trailer.\nA picture with a black camper trailer.\nA picture with a white camper trailer.\nA picture with a orange camper trailer.\nA picture with a purple camper trailer.\nA picture with a red RV with stripes.\nA picture with a blue RV with stripes.\nA picture with a green RV with stripes.\nA picture with a yellow RV with stripes.\nA picture with a black RV with stripes.\nA picture with a white RV with stripes.\nA picture with a orange RV with stripes.\nA picture with a purple RV with stripes.\nA picture with a red delivery scooter.\nA picture with a blue delivery scooter.\nA picture with a green delivery scooter.\nA picture with a yellow delivery scooter.\nA picture with a black delivery scooter.\nA picture with a white delivery scooter.\nA picture with a orange delivery scooter.\nA picture with a purple delivery scooter.\nA picture with a red luxury limousine.\nA picture with a blue luxury limousine.\nA picture with a green luxury limousine.\nA picture with a yellow luxury limousine.\nA picture with a black luxury limousine.\nA picture with a white luxury limousine.\nA picture with a orange luxury limousine.\nA picture with a purple luxury limousine.\nA picture with a red compact sedan.\nA picture with a blue compact sedan.\nA picture with a green compact sedan.\nA picture with a yellow compact sedan.\nA picture with a black compact sedan.\nA picture with a white compact sedan.\nA picture with a orange compact sedan.\nA picture with a purple compact sedan.\nA picture with a red concept car.\nA picture with a blue concept car.\nA picture with a green concept car.\nA picture with a yellow concept car.\nA picture with a black concept car.\nA picture with a white concept car.\nA picture with a orange concept car.\nA picture with a purple concept car.\nA picture with a red autonomous vehicle.\nA picture with a blue autonomous vehicle.\nA picture with a green autonomous vehicle.\nA picture with a yellow autonomous vehicle.\nA picture with a black autonomous vehicle.\nA picture with a white autonomous vehicle.\nA picture with a orange autonomous vehicle.\nA picture with a purple autonomous vehicle.\nA picture with a red VW Beetle.\nA picture with a blue VW Beetle.\nA picture with a green VW Beetle.\nA picture with a yellow VW Beetle.\nA picture with a black VW Beetle.\nA picture with a white VW Beetle.\nA picture with a orange VW Beetle.\nA picture with a purple VW Beetle.\nA picture with a red beverage truck.\nA picture with a blue beverage truck.\nA picture with a green beverage truck.\nA picture with a yellow beverage truck.\nA picture with a black beverage truck.\nA picture with a white beverage truck.\nA picture with a orange beverage truck.\nA picture with a purple beverage truck.\nA picture with a red food truck.\nA picture with a blue food truck.\nA picture with a green food truck.\nA picture with a yellow food truck.\nA picture with a black food truck.\nA picture with a white food truck.\nA picture with a orange food truck.\nA picture with a purple food truck.\nA picture with a red cargo trailer.\nA picture with a blue cargo trailer.\nA picture with a green cargo trailer.\nA picture with a yellow cargo trailer.\nA picture with a black cargo trailer.\nA picture with a white cargo trailer.\nA picture with a orange cargo trailer.\nA picture with a purple cargo trailer.\nA picture with a red bulldozer.\nA picture with a blue bulldozer.\nA picture with a green bulldozer.\nA picture with a yellow bulldozer.\nA picture with a black bulldozer.\nA picture with a white bulldozer.\nA picture with a orange bulldozer.\nA picture with a purple bulldozer.\nA picture with a red tram car.\nA picture with a blue tram car.\nA picture with a green tram car.\nA picture with a yellow tram car.\nA picture with a black tram car.\nA picture with a white tram car.\nA picture with a orange tram car.\nA picture with a purple tram car.\nA picture with a red bus.\nA picture with a blue bus.\nA picture with a green bus.\nA picture with a yellow bus.\nA picture with a black bus.\nA picture with a white bus.\nA picture with a orange bus.\nA picture with a purple bus.\nA picture with a red taxi.\nA picture with a blue taxi.\nA picture with a green taxi.\nA picture with a yellow taxi.\nA picture with a black taxi.\nA picture with a white taxi.\nA picture with a orange taxi.\nA picture with a purple taxi.\nA picture with a red custom jeep.\nA picture with a blue custom jeep.\nA picture with a green custom jeep.\nA picture with a yellow custom jeep.\nA picture with a black custom jeep.\nA picture with a white custom jeep.\nA picture with a orange custom jeep.\nA picture with a purple custom jeep.\nA picture with a red chopper bike.\nA picture with a blue chopper bike.\nA picture with a green chopper bike.\nA picture with a yellow chopper bike.\nA picture with a black chopper bike.\nA picture with a white chopper bike.\nA picture with a orange chopper bike.\nA picture with a purple chopper bike.\nA picture with a red hovercraft.\nA picture with a blue hovercraft.\nA picture with a green hovercraft.\nA picture with a yellow hovercraft.\nA picture with a black hovercraft.\nA picture with a white hovercraft.\nA picture with a orange hovercraft.\nA picture with a purple hovercraft.\nA picture with a red snowplow.\nA picture with a blue snowplow.\nA picture with a green snowplow.\nA picture with a yellow snowplow.\nA picture with a black snowplow.\nA picture with a white snowplow.\nA picture with a orange snowplow.\nA picture with a purple snowplow.\nA picture with a red golf buggy.\nA picture with a blue golf buggy.\nA picture with a green golf buggy.\nA picture with a yellow golf buggy.\nA picture with a black golf buggy.\nA picture with a white golf buggy.\nA picture with a orange golf buggy.\nA picture with a purple golf buggy.\nA picture with a red submarine.\nA picture with a blue submarine.\nA picture with a green submarine.\nA picture with a yellow submarine.\nA picture with a black submarine.\nA picture with a white submarine.\nA picture with a orange submarine.\nA picture with a purple submarine.\nA picture with a red space shuttle.\nA picture with a blue space shuttle.\nA picture with a green space shuttle.\nA picture with a yellow space shuttle.\nA picture with a black space shuttle.\nA picture with a white space shuttle.\nA picture with a orange space shuttle.\nA picture with a purple space shuttle.\nA picture with a red cable car.\nA picture with a blue cable car.\nA picture with a green cable car.\nA picture with a yellow cable car.\nA picture with a black cable car.\nA picture with a white cable car.\nA picture with a orange cable car.\nA picture with a purple cable car.\nA picture with a red rickshaw.\nA picture with a blue rickshaw.\nA picture with a green rickshaw.\nA picture with a yellow rickshaw.\nA picture with a black rickshaw.\nA picture with a white rickshaw.\nA picture with a orange rickshaw.\nA picture with a purple rickshaw.\nA picture with a red rowing boat.\nA picture with a blue rowing boat.\nA picture with a green rowing boat.\nA picture with a yellow rowing boat.\nA picture with a black rowing boat.\nA picture with a white rowing boat.\nA picture with a orange rowing boat.\nA picture with a purple rowing boat.\nA picture with a red kayak.\nA picture with a blue kayak.\nA picture with a green kayak.\nA picture with a yellow kayak.\nA picture with a black kayak.\nA picture with a white kayak.\nA picture with a orange kayak.\nA picture with a purple kayak.\nA picture with a red canoe.\nA picture with a blue canoe.\nA picture with a green canoe.\nA picture with a yellow canoe.\nA picture with a black canoe.\nA picture with a white canoe.\nA picture with a orange canoe.\nA picture with a purple canoe.\nA picture with a red yacht.\nA picture with a blue yacht.\nA picture with a green yacht.\nA picture with a yellow yacht.\nA picture with a black yacht.\nA picture with a white yacht.\nA picture with a orange yacht.\nA picture with a purple yacht.\nA picture with a red fishing boat.\nA picture with a blue fishing boat.\nA picture with a green fishing boat.\nA picture with a yellow fishing boat.\nA picture with a black fishing boat.\nA picture with a white fishing boat.\nA picture with a orange fishing boat.\nA picture with a purple fishing boat.\nA picture with a red cruise ship.\nA picture with a blue cruise ship.\nA picture with a green cruise ship.\nA picture with a yellow cruise ship.\nA picture with a black cruise ship.\nA picture with a white cruise ship.\nA picture with a orange cruise ship.\nA picture with a purple cruise ship.\nA picture with a red sailboat.\nA picture with a blue sailboat.\nA picture with a green sailboat.\nA picture with a yellow sailboat.\nA picture with a black sailboat.\nA picture with a white sailboat.\nA picture with a orange sailboat.\nA picture with a purple sailboat.\nA picture with a red dinghy.\nA picture with a blue dinghy.\nA picture with a green dinghy.\nA picture with a yellow dinghy.\nA picture with a black dinghy.\nA picture with a white dinghy.\nA picture with a orange dinghy.\nA picture with a purple dinghy.\nA picture with a red paddle boat.\nA picture with a blue paddle boat.\nA picture with a green paddle boat.\nA picture with a yellow paddle boat.\nA picture with a black paddle boat.\nA picture with a white paddle boat.\nA picture with a orange paddle boat.\nA picture with a purple paddle boat.\nA picture with a red jet ski.\nA picture with a blue jet ski.\nA picture with a green jet ski.\nA picture with a yellow jet ski.\nA picture with a black jet ski.\nA picture with a white jet ski.\nA picture with a orange jet ski.\nA picture with a purple jet ski.\nA picture with a red amphibious vehicle.\nA picture with a blue amphibious vehicle.\nA picture with a green amphibious vehicle.\nA picture with a yellow amphibious vehicle.\nA picture with a black amphibious vehicle.\nA picture with a white amphibious vehicle.\nA picture with a orange amphibious vehicle.\nA picture with a purple amphibious vehicle.\nA picture with a red glider.\nA picture with a blue glider.\nA picture with a green glider.\nA picture with a yellow glider.\nA picture with a black glider.\nA picture with a white glider.\nA picture with a orange glider.\nA picture with a purple glider.\nA picture with a red light aircraft.\nA picture with a blue light aircraft.\nA picture with a green light aircraft.\nA picture with a yellow light aircraft.\nA picture with a black light aircraft.\nA picture with a white light aircraft.\nA picture with a orange light aircraft.\nA picture with a purple light aircraft.\nA picture with a red hot air balloon.\nA picture with a blue hot air balloon.\nA picture with a green hot air balloon.\nA picture with a yellow hot air balloon.\nA picture with a black hot air balloon.\nA picture with a white hot air balloon.\nA picture with a orange hot air balloon.\nA picture with a purple hot air balloon.\nA picture with a red helicopter.\nA picture with a blue helicopter.\nA picture with a green helicopter.\nA picture with a yellow helicopter.\nA picture with a black helicopter.\nA picture with a white helicopter.\nA picture with a orange helicopter.\nA picture with a purple helicopter.\nA picture with a red monorail.\nA picture with a blue monorail.\nA picture with a green monorail.\nA picture with a yellow monorail.\nA picture with a black monorail.\nA picture with a white monorail.\nA picture with a orange monorail.\nA picture with a purple monorail.\nA picture with a red steam train.\nA picture with a blue steam train.\nA picture with a green steam train.\nA picture with a yellow steam train.\nA picture with a black steam train.\nA picture with a white steam train.\nA picture with a orange steam train.\nA picture with a purple steam train.\nA picture with a red freight train.\nA picture with a blue freight train.\nA picture with a green freight train.\nA picture with a yellow freight train.\nA picture with a black freight train.\nA picture with a white freight train.\nA picture with a orange freight train.\nA picture with a purple freight train.\nA picture with a red bullet train.\nA picture with a blue bullet train.\nA picture with a green bullet train.\nA picture with a yellow bullet train.\nA picture with a black bullet train.\nA picture with a white bullet train.\nA picture with a orange bullet train.\nA picture with a purple bullet train.\nA picture with a red tram.\nA picture with a blue tram.\nA picture with a green tram.\nA picture with a yellow tram.\nA picture with a black tram.\nA picture with a white tram.\nA picture with a orange tram.\nA picture with a purple tram.\nA picture with a red subway car.\nA picture with a blue subway car.\nA picture with a green subway car.\nA picture with a yellow subway car.\nA picture with a black subway car.\nA picture with a white subway car.\nA picture with a orange subway car.\nA picture with a purple subway car.\nA picture with a red trolleybus.\nA picture with a blue trolleybus.\nA picture with a green trolleybus.\nA picture with a yellow trolleybus.\nA picture with a black trolleybus.\nA picture with a white trolleybus.\nA picture with a orange trolleybus.\nA picture with a purple trolleybus.\nA picture with a red caravan.\nA picture with a blue caravan.\nA picture with a green caravan.\nA picture with a yellow caravan.\nA picture with a black caravan.\nA picture with a white caravan.\nA picture with a orange caravan.\nA picture with a purple caravan.\nA picture with a red utility van.\nA picture with a blue utility van.\nA picture with a green utility van.\nA picture with a yellow utility van.\nA picture with a black utility van.\nA picture with a white utility van.\nA picture with a orange utility van.\nA picture with a purple utility van.\nA picture with a red towable RV.\nA picture with a blue towable RV.\nA picture with a green towable RV.\nA picture with a yellow towable RV.\nA picture with a black towable RV.\nA picture with a white towable RV.\nA picture with a orange towable RV.\nA picture with a purple towable RV.\nA picture with a red microcar.\nA picture with a blue microcar.\nA picture with a green microcar.\nA picture with a yellow microcar.\nA picture with a black microcar.\nA picture with a white microcar.\nA picture with a orange microcar.\nA picture with a purple microcar.\nA picture with a red electric scooter.\nA picture with a blue electric scooter.\nA picture with a green electric scooter.\nA picture with a yellow electric scooter.\nA picture with a black electric scooter.\nA picture with a white electric scooter.\nA picture with a orange electric scooter.\nA picture with a purple electric scooter.\nA picture with a red all-terrain vehicle.\nA picture with a blue all-terrain vehicle.\nA picture with a green all-terrain vehicle.\nA picture with a yellow all-terrain vehicle.\nA picture with a black all-terrain vehicle.\nA picture with a white all-terrain vehicle.\nA picture with a orange all-terrain vehicle.\nA picture with a purple all-terrain vehicle.\nA picture with a red off-road buggy.\nA picture with a blue off-road buggy.\nA picture with a green off-road buggy.\nA picture with a yellow off-road buggy.\nA picture with a black off-road buggy.\nA picture with a white off-road buggy.\nA picture with a orange off-road buggy.\nA picture with a purple off-road buggy.\nA picture with a red personal watercraft.\nA picture with a blue personal watercraft.\nA picture with a green personal watercraft.\nA picture with a yellow personal watercraft.\nA picture with a black personal watercraft.\nA picture with a white personal watercraft.\nA picture with a orange personal watercraft.\nA picture with a purple personal watercraft.\nA picture with a red moped.\nA picture with a blue moped.\nA picture with a green moped.\nA picture with a yellow moped.\nA picture with a black moped.\nA picture with a white moped.\nA picture with a orange moped.\nA picture with a purple moped.\nA picture with a red minibike.\nA picture with a blue minibike.\nA picture with a green minibike.\nA picture with a yellow minibike.\nA picture with a black minibike.\nA picture with a white minibike.\nA picture with a orange minibike.\nA picture with a purple minibike.\nA picture with a red bicycle.\nA picture with a blue bicycle.\nA picture with a green bicycle.\nA picture with a yellow bicycle.\nA picture with a black bicycle.\nA picture with a white bicycle.\nA picture with a orange bicycle.\nA picture with a purple bicycle.\nA picture with a red unicycle.\nA picture with a blue unicycle.\nA picture with a green unicycle.\nA picture with a yellow unicycle.\nA picture with a black unicycle.\nA picture with a white unicycle.\nA picture with a orange unicycle.\nA picture with a purple unicycle.\nA picture with a red segway.\nA picture with a blue segway.\nA picture with a green segway.\nA picture with a yellow segway.\nA picture with a black segway.\nA picture with a white segway.\nA picture with a orange segway.\nA picture with a purple segway.\nA picture with a red self-driving car.\nA picture with a blue self-driving car.\nA picture with a green self-driving car.\nA picture with a yellow self-driving car.\nA picture with a black self-driving car.\nA picture with a white self-driving car.\nA picture with a orange self-driving car.\nA picture with a purple self-driving car.\nA picture with a red ride-on lawnmower.\nA picture with a blue ride-on lawnmower.\nA picture with a green ride-on lawnmower.\nA picture with a yellow ride-on lawnmower.\nA picture with a black ride-on lawnmower.\nA picture with a white ride-on lawnmower.\nA picture with a orange ride-on lawnmower.\nA picture with a purple ride-on lawnmower.\nA picture with a red tractor-trailer.\nA picture with a blue tractor-trailer.\nA picture with a green tractor-trailer.\nA picture with a yellow tractor-trailer.\nA picture with a black tractor-trailer.\nA picture with a white tractor-trailer.\nA picture with a orange tractor-trailer.\nA picture with a purple tractor-trailer.\nA picture with a red semi-truck.\nA picture with a blue semi-truck.\nA picture with a green semi-truck.\nA picture with a yellow semi-truck.\nA picture with a black semi-truck.\nA picture with a white semi-truck.\nA picture with a orange semi-truck.\nA picture with a purple semi-truck.\nA picture with a red lowboy truck.\nA picture with a blue lowboy truck.\nA picture with a green lowboy truck.\nA picture with a yellow lowboy truck.\nA picture with a black lowboy truck.\nA picture with a white lowboy truck.\nA picture with a orange lowboy truck.\nA picture with a purple lowboy truck.\nA picture with a red box truck.\nA picture with a blue box truck.\nA picture with a green box truck.\nA picture with a yellow box truck.\nA picture with a black box truck.\nA picture with a white box truck.\nA picture with a orange box truck.\nA picture with a purple box truck.\nA picture with a red refrigerated truck.\nA picture with a blue refrigerated truck.\nA picture with a green refrigerated truck.\nA picture with a yellow refrigerated truck.\nA picture with a black refrigerated truck.\nA picture with a white refrigerated truck.\nA picture with a orange refrigerated truck.\nA picture with a purple refrigerated truck.\nA picture with a red cement mixer.\nA picture with a blue cement mixer.\nA picture with a green cement mixer.\nA picture with a yellow cement mixer.\nA picture with a black cement mixer.\nA picture with a white cement mixer.\nA picture with a orange cement mixer.\nA picture with a purple cement mixer.\nA picture with a red dump truck.\nA picture with a blue dump truck.\nA picture with a green dump truck.\nA picture with a yellow dump truck.\nA picture with a black dump truck.\nA picture with a white dump truck.\nA picture with a orange dump truck.\nA picture with a purple dump truck.\nA picture with a red flatbed truck.\nA picture with a blue flatbed truck.\nA picture with a green flatbed truck.\nA picture with a yellow flatbed truck.\nA picture with a black flatbed truck.\nA picture with a white flatbed truck.\nA picture with a orange flatbed truck.\nA picture with a purple flatbed truck.\nA picture with a red log carrier.\nA picture with a blue log carrier.\nA picture with a green log carrier.\nA picture with a yellow log carrier.\nA picture with a black log carrier.\nA picture with a white log carrier.\nA picture with a orange log carrier.\nA picture with a purple log carrier.\nA picture with a red mining truck.\nA picture with a blue mining truck.\nA picture with a green mining truck.\nA picture with a yellow mining truck.\nA picture with a black mining truck.\nA picture with a white mining truck.\nA picture with a orange mining truck.\nA picture with a purple mining truck.\nA picture with a red tank.\nA picture with a blue tank.\nA picture with a green tank.\nA picture with a yellow tank.\nA picture with a black tank.\nA picture with a white tank.\nA picture with a orange tank.\nA picture with a purple tank.\nA picture with a red troop carrier.\nA picture with a blue troop carrier.\nA picture with a green troop carrier.\nA picture with a yellow troop carrier.\nA picture with a black troop carrier.\nA picture with a white troop carrier.\nA picture with a orange troop carrier.\nA picture with a purple troop carrier.\nA picture with a red fire engine.\nA picture with a blue fire engine.\nA picture with a green fire engine.\nA picture with a yellow fire engine.\nA picture with a black fire engine.\nA picture with a white fire engine.\nA picture with a orange fire engine.\nA picture with a purple fire engine.\nA picture with a red rescue boat.\nA picture with a blue rescue boat.\nA picture with a green rescue boat.\nA picture with a yellow rescue boat.\nA picture with a black rescue boat.\nA picture with a white rescue boat.\nA picture with a orange rescue boat.\nA picture with a purple rescue boat.\nA picture with a red lifeboat.\nA picture with a blue lifeboat.\nA picture with a green lifeboat.\nA picture with a yellow lifeboat.\nA picture with a black lifeboat.\nA picture with a white lifeboat.\nA picture with a orange lifeboat.\nA picture with a purple lifeboat.\nA picture with a red pontoon boat.\nA picture with a blue pontoon boat.\nA picture with a green pontoon boat.\nA picture with a yellow pontoon boat.\nA picture with a black pontoon boat.\nA picture with a white pontoon boat.\nA picture with a orange pontoon boat.\nA picture with a purple pontoon boat.\nA picture with a red scooter board.\nA picture with a blue scooter board.\nA picture with a green scooter board.\nA picture with a yellow scooter board.\nA picture with a black scooter board.\nA picture with a white scooter board.\nA picture with a orange scooter board.\nA picture with a purple scooter board.\nA picture with a red hoverboard.\nA picture with a blue hoverboard.\nA picture with a green hoverboard.\nA picture with a yellow hoverboard.\nA picture with a black hoverboard.\nA picture with a white hoverboard.\nA picture with a orange hoverboard.\nA picture with a purple hoverboard.\nA picture with a red electric skateboard.\nA picture with a blue electric skateboard.\nA picture with a green electric skateboard.\nA picture with a yellow electric skateboard.\nA picture with a black electric skateboard.\nA picture with a white electric skateboard.\nA picture with a orange electric skateboard.\nA picture with a purple electric skateboard.\nA picture with a red kick scooter.\nA picture with a blue kick scooter.\nA picture with a green kick scooter.\nA picture with a yellow kick scooter.\nA picture with a black kick scooter.\nA picture with a white kick scooter.\nA picture with a orange kick scooter.\nA picture with a purple kick scooter.\nA picture with a red powered parachute.\nA picture with a blue powered parachute.\nA picture with a green powered parachute.\nA picture with a yellow powered parachute.\nA picture with a black powered parachute.\nA picture with a white powered parachute.\nA picture with a orange powered parachute.\nA picture with a purple powered parachute.\nA picture with a red paraglider.\nA picture with a blue paraglider.\nA picture with a green paraglider.\nA picture with a yellow paraglider.\nA picture with a black paraglider.\nA picture with a white paraglider.\nA picture with a orange paraglider.\nA picture with a purple paraglider.\nA picture with a red airship.\nA picture with a blue airship.\nA picture with a green airship.\nA picture with a yellow airship.\nA picture with a black airship.\nA picture with a white airship.\nA picture with a orange airship.\nA picture with a purple airship.\nA picture with a red blimp.\nA picture with a blue blimp.\nA picture with a green blimp.\nA picture with a yellow blimp.\nA picture with a black blimp.\nA picture with a white blimp.\nA picture with a orange blimp.\nA picture with a purple blimp.\nA picture with a red dirigible.\nA picture with a blue dirigible.\nA picture with a green dirigible.\nA picture with a yellow dirigible.\nA picture with a black dirigible.\nA picture with a white dirigible.\nA picture with a orange dirigible.\nA picture with a purple dirigible.\nA picture with a red crane.\nA picture with a blue crane.\nA picture with a green crane.\nA picture with a yellow crane.\nA picture with a black crane.\nA picture with a white crane.\nA picture with a orange crane.\nA picture with a purple crane.\nA picture with a red excavator.\nA picture with a blue excavator.\nA picture with a green excavator.\nA picture with a yellow excavator.\nA picture with a black excavator.\nA picture with a white excavator.\nA picture with a orange excavator.\nA picture with a purple excavator.\nA picture with a red front loader.\nA picture with a blue front loader.\nA picture with a green front loader.\nA picture with a yellow front loader.\nA picture with a black front loader.\nA picture with a white front loader.\nA picture with a orange front loader.\nA picture with a purple front loader.\nA picture with a red grader.\nA picture with a blue grader.\nA picture with a green grader.\nA picture with a yellow grader.\nA picture with a black grader.\nA picture with a white grader.\nA picture with a orange grader.\nA picture with a purple grader.\nA picture with a red road roller.\nA picture with a blue road roller.\nA picture with a green road roller.\nA picture with a yellow road roller.\nA picture with a black road roller.\nA picture with a white road roller.\nA picture with a orange road roller.\nA picture with a purple road roller.\nA picture with a red paver.\nA picture with a blue paver.\nA picture with a green paver.\nA picture with a yellow paver.\nA picture with a black paver.\nA picture with a white paver.\nA picture with a orange paver.\nA picture with a purple paver.\nA picture with a red cherry picker.\nA picture with a blue cherry picker.\nA picture with a green cherry picker.\nA picture with a yellow cherry picker.\nA picture with a black cherry picker.\nA picture with a white cherry picker.\nA picture with a orange cherry picker.\nA picture with a purple cherry picker.\nA picture with a red scissor lift.\nA picture with a blue scissor lift.\nA picture with a green scissor lift.\nA picture with a yellow scissor lift.\nA picture with a black scissor lift.\nA picture with a white scissor lift.\nA picture with a orange scissor lift.\nA picture with a purple scissor lift.\nA picture with a red forklift.\nA picture with a blue forklift.\nA picture with a green forklift.\nA picture with a yellow forklift.\nA picture with a black forklift.\nA picture with a white forklift.\nA picture with a orange forklift.\nA picture with a purple forklift.\nA picture with a red warehouse tug.\nA picture with a blue warehouse tug.\nA picture with a green warehouse tug.\nA picture with a yellow warehouse tug.\nA picture with a black warehouse tug.\nA picture with a white warehouse tug.\nA picture with a orange warehouse tug.\nA picture with a purple warehouse tug.\nA picture with a red skid-steer loader.\nA picture with a blue skid-steer loader.\nA picture with a green skid-steer loader.\nA picture with a yellow skid-steer loader.\nA picture with a black skid-steer loader.\nA picture with a white skid-steer loader.\nA picture with a orange skid-steer loader.\nA picture with a purple skid-steer loader.\nA picture with a red street sweeper.\nA picture with a blue street sweeper.\nA picture with a green street sweeper.\nA picture with a yellow street sweeper.\nA picture with a black street sweeper.\nA picture with a white street sweeper.\nA picture with a orange street sweeper.\nA picture with a purple street sweeper.\nA picture with a red garbage compactor.\nA picture with a blue garbage compactor.\nA picture with a green garbage compactor.\nA picture with a yellow garbage compactor.\nA picture with a black garbage compactor.\nA picture with a white garbage compactor.\nA picture with a orange garbage compactor.\nA picture with a purple garbage compactor.\nA picture with a red auto rickshaw.\nA picture with a blue auto rickshaw.\nA picture with a green auto rickshaw.\nA picture with a yellow auto rickshaw.\nA picture with a black auto rickshaw.\nA picture with a white auto rickshaw.\nA picture with a orange auto rickshaw.\nA picture with a purple auto rickshaw.\nA picture with a red electric trike.\nA picture with a blue electric trike.\nA picture with a green electric trike.\nA picture with a yellow electric trike.\nA picture with a black electric trike.\nA picture with a white electric trike.\nA picture with a orange electric trike.\nA picture with a purple electric trike.\nA picture with a red luxury yacht.\nA picture with a blue luxury yacht.\nA picture with a green luxury yacht.\nA picture with a yellow luxury yacht.\nA picture with a black luxury yacht.\nA picture with a white luxury yacht.\nA picture with a orange luxury yacht.\nA picture with a purple luxury yacht.\nA picture with a red speedboat.\nA picture with a blue speedboat.\nA picture with a green speedboat.\nA picture with a yellow speedboat.\nA picture with a black speedboat.\nA picture with a white speedboat.\nA picture with a orange speedboat.\nA picture with a purple speedboat.\nA picture with a red deep-sea trawler.\nA picture with a blue deep-sea trawler.\nA picture with a green deep-sea trawler.\nA picture with a yellow deep-sea trawler.\nA picture with a black deep-sea trawler.\nA picture with a white deep-sea trawler.\nA picture with a orange deep-sea trawler.\nA picture with a purple deep-sea trawler.\nA picture with a red ferry.\nA picture with a blue ferry.\nA picture with a green ferry.\nA picture with a yellow ferry.\nA picture with a black ferry.\nA picture with a white ferry.\nA picture with a orange ferry.\nA picture with a purple ferry.\nA picture with a red hovertrain.\nA picture with a blue hovertrain.\nA picture with a green hovertrain.\nA picture with a yellow hovertrain.\nA picture with a black hovertrain.\nA picture with a white hovertrain.\nA picture with a orange hovertrain.\nA picture with a purple hovertrain.\nA picture with a red mountain bike.\nA picture with a blue mountain bike.\nA picture with a green mountain bike.\nA picture with a yellow mountain bike.\nA picture with a black mountain bike.\nA picture with a white mountain bike.\nA picture with a orange mountain bike.\nA picture with a purple mountain bike.\nA picture with a red road bike.\nA picture with a blue road bike.\nA picture with a green road bike.\nA picture with a yellow road bike.\nA picture with a black road bike.\nA picture with a white road bike.\nA picture with a orange road bike.\nA picture with a purple road bike.\nA picture with a red fixie bike.\nA picture with a blue fixie bike.\nA picture with a green fixie bike.\nA picture with a yellow fixie bike.\nA picture with a black fixie bike.\nA picture with a white fixie bike.\nA picture with a orange fixie bike.\nA picture with a purple fixie bike.\nA picture with a red electric mountain bike.\nA picture with a blue electric mountain bike.\nA picture with a green electric mountain bike.\nA picture with a yellow electric mountain bike.\nA picture with a black electric mountain bike.\nA picture with a white electric mountain bike.\nA picture with a orange electric mountain bike.\nA picture with a purple electric mountain bike.\nA picture with a red cargo bike.\nA picture with a blue cargo bike.\nA picture with a green cargo bike.\nA picture with a yellow cargo bike.\nA picture with a black cargo bike.\nA picture with a white cargo bike.\nA picture with a orange cargo bike.\nA picture with a purple cargo bike.\nA picture with a red delivery trike.\nA picture with a blue delivery trike.\nA picture with a green delivery trike.\nA picture with a yellow delivery trike.\nA picture with a black delivery trike.\nA picture with a white delivery trike.\nA picture with a orange delivery trike.\nA picture with a purple delivery trike.\nA picture with a red recumbent bike.\nA picture with a blue recumbent bike.\nA picture with a green recumbent bike.\nA picture with a yellow recumbent bike.\nA picture with a black recumbent bike.\nA picture with a white recumbent bike.\nA picture with a orange recumbent bike.\nA picture with a purple recumbent bike.\nA picture with a red pedal car.\nA picture with a blue pedal car.\nA picture with a green pedal car.\nA picture with a yellow pedal car.\nA picture with a black pedal car.\nA picture with a white pedal car.\nA picture with a orange pedal car.\nA picture with a purple pedal car.\nA picture with a red soapbox derby car.\nA picture with a blue soapbox derby car.\nA picture with a green soapbox derby car.\nA picture with a yellow soapbox derby car.\nA picture with a black soapbox derby car.\nA picture with a white soapbox derby car.\nA picture with a orange soapbox derby car.\nA picture with a purple soapbox derby car.\nA picture with a red snowmobile sled.\nA picture with a blue snowmobile sled.\nA picture with a green snowmobile sled.\nA picture with a yellow snowmobile sled.\nA picture with a black snowmobile sled.\nA picture with a white snowmobile sled.\nA picture with a orange snowmobile sled.\nA picture with a purple snowmobile sled.\nA picture with a red rock crawler.\nA picture with a blue rock crawler.\nA picture with a green rock crawler.\nA picture with a yellow rock crawler.\nA picture with a black rock crawler.\nA picture with a white rock crawler.\nA picture with a orange rock crawler.\nA picture with a purple rock crawler.",true],"color":"#223","bgcolor":"#335"},{"id":5,"type":"IPSaveConceptSubspace","pos":[-740,-2270],"size":[260,60],"flags":{},"order":3,"mode":0,"inputs":[{"localized_name":"concept_subspace","name":"concept_subspace","type":"CONCEPT_SUBSPACE","link":5},{"localized_name":"concept_name","name":"concept_name","type":"STRING","widget":{"name":"concept_name"},"link":null}],"outputs":[],"properties":{"aux_id":"godmt/ComfyUI-IP-Composer","ver":"f952bbaaf0ef8a5417017f155796b29636ea642e","Node name for S&R":"IPSaveConceptSubspace"},"widgets_values":["vehicle_with_color"],"color":"#322","bgcolor":"#533"}],"links":[[3,4,0,3,0,"OPEN_CLIP"],[4,1,0,3,1,"STRING"],[5,3,0,5,0,"CONCEPT_SUBSPACE"]],"groups":[],"config":{},"extra":{"ds":{"scale":1.2284597357368374,"offset":[1351.918253123226,2396.5796920960443]},"ue_links":[]},"version":0.4}